sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mfcom.c
                trigger_polarity: MFCOM_TIMER_TRGPOL_ACTIVE_HIGH
                                  MFCOM_TIMER_TRGPOL_ACTIVE_LOW

                pin_config: MFCOM_TIMER_PINCFG_INPUT    MFCOM_TIMER_PINCFG_OPENDRAIN
                            MFCOM_TIMER_PINCFG_BIDI     MFCOM_TIMER_PINCFG_OUTPUT

                pin_select: MFCOM_TIMER_PINSEL_PIN0      MFCOM_TIMER_PINSEL_PIN1
                            MFCOM_TIMER_PINSEL_PIN2      MFCOM_TIMER_PINSEL_PIN3
                            MFCOM_TIMER_PINSEL_PIN4      MFCOM_TIMER_PINSEL_PIN5
                            MFCOM_TIMER_PINSEL_PIN6      MFCOM_TIMER_PINSEL_PIN7

                pin_polarity: MFCOM_TIMER_PINPOL_ACTIVE_HIGH
                              MFCOM_TIMER_PINPOL_ACTIVE_LOW

                mode: MFCOM_TIMER_DISABLE      MFCOM_TIMER_BAUDMODE
                      MFCOM_TIMER_PWMMODE      MFCOM_TIMER_16BITCOUNTER

                output: MFCOM_TIMER_OUT_HIGH_EN          MFCOM_TIMER_OUT_LOW_EN
                        MFCOM_TIMER_OUT_HIGH_EN_RESET    MFCOM_TIMER_OUT_LOW_EN_RESET

                decrement: MFCOM_TIMER_DEC_CLK_SHIFT_OUT    MFCOM_TIMER_DEC_TRIG_SHIFT_OUT
                           MFCOM_TIMER_DEC_PIN_SHIFT_PIN    MFCOM_TIMER_DEC_TRIG_SHIFT_TRIG

                reset: MFCOM_TIMER_RESET_NEVER              MFCOM_TIMER_RESET_PIN_TIMOUT
                       MFCOM_TIMER_RESET_TRIG_TIMOUT        MFCOM_TIMER_RESET_PIN_RISING
                       MFCOM_TIMER_RESET_TRIG_RISING        MFCOM_TIMER_RESET_TRIG_BOTH

                disable: MFCOM_TIMER_DISMODE_NEVER           MFCOM_TIMER_DISMODE_PRE_TIMDIS
                         MFCOM_TIMER_DISMODE_COMPARE         MFCOM_TIMER_DISMODE_COMPARE_TRIGLOW
                         MFCOM_TIMER_DISMODE_PINBOTH         MFCOM_TIMER_DISMODE_PINBOTH_TRIGHIGH
                         MFCOM_TIMER_DISMODE_TRIGFALLING

                enable: MFCOM_TIMER_ENMODE_ALWAYS            MFCOM_TIMER_ENMODE_PRE_TIMEN
                        MFCOM_TIMER_ENMODE_TRIGHIGH          MFCOM_TIMER_ENMODE_TRIGHIGH_PINHIGH
                        MFCOM_TIMER_ENMODE_PINRISING         MFCOM_TIMER_ENMODE_PINRISING_TRIGHIGH
                        MFCOM_TIMER_ENMODE_TRIGRISING        MFCOM_TIMER_ENMODE_TRIGBOTH

                stopbit: MFCOM_TIMER_STOPBIT_DISABLE        MFCOM_TIMER_STOPBIT_TIMCMP
                         MFCOM_TIMER_STOPBIT_TIMDIS         MFCOM_TIMER_STOPBIT_TIMCMP_TIMDIS

                startbit: MFCOM_TIMER_STARTBIT_DISABLE
                          MFCOM_TIMER_STARTBIT_ENABLE

                compare: compare value
    \param[out] none
    \retval     none
*/
void mfcom_timer_init(mfcom_timer_enum timer, mfcom_timer_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x0007), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure compare value */
        MFCOM_TMCMP((uint32_t)timer) = (uint32_t)(init_struct->compare);
        /* configure timer output/decrement/reset/disable/enable/stopbit/startbit */
        MFCOM_TMCFG((uint32_t)timer) = init_struct->output | init_struct->decrement | init_struct->reset | init_struct->disable | init_struct->enable | init_struct->stopbit | init_struct->startbit;

        /* configure pin trigger_select/trigger_polarity/pin_config/pin_select/pin_polarity/mode */
        MFCOM_TMCTL((uint32_t)timer) = init_struct->trigger_select | init_struct->trigger_polarity | init_struct->pin_config | init_struct->pin_select | init_struct->pin_polarity | init_struct->mode;
    }
}

/*!
    \brief      initialize MFCOM shifter parameter, API ID: 0x0008
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  init_struct: the initialization shifter parameter
      \arg         timer_select: MFCOM_SHIFTER_TIMER0   MFCOM_SHIFTER_TIMER1
                                 MFCOM_SHIFTER_TIMER2   MFCOM_SHIFTER_TIMER3

                timer_polarity: MFCOM_SHIFTER_TIMPOL_ACTIVE_HIGH
                                MFCOM_SHIFTER_TIMPOL_ACTIVE_LOW

                pin_config: MFCOM_SHIFTER_PINCFG_INPUT    MFCOM_SHIFTER_PINCFG_OPENDRAIN
                            MFCOM_SHIFTER_PINCFG_BIDI     MFCOM_SHIFTER_PINCFG_OUTPUT

                pin_select: MFCOM_SHIFTER_PINSEL_PIN0       MFCOM_SHIFTER_PINSEL_PIN1
                            MFCOM_SHIFTER_PINSEL_PIN2       MFCOM_SHIFTER_PINSEL_PIN3
                            MFCOM_SHIFTER_PINSEL_PIN4       MFCOM_SHIFTER_PINSEL_PIN5
                            MFCOM_SHIFTER_PINSEL_PIN6       MFCOM_SHIFTER_PINSEL_PIN7

                pin_polarity: MFCOM_SHIFTER_PINPOL_ACTIVE_HIGH
                              MFCOM_SHIFTER_PINPOL_ACTIVE_LOW

                mode: MFCOM_SHIFTER_DISABLE         MFCOM_SHIFTER_RECEIVE
                      MFCOM_SHIFTER_TRANSMIT

                input_source: MFCOM_SHIFTER_INSRC_PIN
                              MFCOM_SHIFTER_INSRC_NEXTSHIFTER

                stopbit: MFCOM_SHIFTER_STOPBIT_DISABLE    MFCOM_SHIFTER_STOPBIT_LOW
                         MFCOM_SHIFTER_STOPBIT_HIGH

                startbit: MFCOM_SHIFTER_STARTBIT_DISABLE     MFCOM_SHIFTER_STARTBIT_DISABLE_TXEN
                          MFCOM_SHIFTER_STARTBIT_LOW         MFCOM_SHIFTER_STARTBIT_HIGH
    \param[out] none
    \retval     none
*/
void mfcom_shifter_init(mfcom_shifter_enum shifter, mfcom_shifter_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x0008), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure shifter input_source/stopbit/startbit */
        MFCOM_SCFG((uint32_t)shifter) = init_struct->input_source | init_struct->stopbit | init_struct->startbit;

        /* configure shifter timer_select/timer_polarity/pin_config/pin_select/pin_polarity/mode */
        MFCOM_SCTL((uint32_t)shifter) = init_struct->timer_select | init_struct->timer_polarity | init_struct->pin_config | init_struct->pin_select | init_struct->pin_polarity | init_struct->mode;
    }
}

/*!
    \brief      configure timer pin mode, API ID: 0x0009
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[in]  outputmode:
      \arg         MFCOM_TIMER_PINCFG_INPUT:      pin input
      \arg         MFCOM_TIMER_PINCFG_OPENDRAIN:  pin open drain or bidirectional output enable
      \arg         MFCOM_TIMER_PINCFG_BIDI:       pin bidirectional output data
      \arg         MFCOM_TIMER_PINCFG_OUTPUT:     pin output
    \param[out] none
    \retval     none
*/
void mfcom_timer_pin_config(mfcom_timer_enum timer, uint32_t mode)
{
    uint32_t temp;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MFCOM_TIMER_PINCFG(mode)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x0009), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = MFCOM_TMCTL((uint32_t)timer);

