sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mfcom.c
        /* clear timer pin configuration bits */
        temp &= ~MFCOM_TMCTL_TMPCFG;

        /* set timer pin outputmode */
        temp |= mode;
        MFCOM_TMCTL((uint32_t)timer) = temp;
    }
}

/*!
    \brief      configure shifter pin mode, API ID: 0x000A
    \param[in]  shifter:  MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  outputmode:
      \arg         MFCOM_SHIFTER_PINCFG_INPUT: pin input
      \arg         MFCOM_SHIFTER_PINCFG_OPENDRAIN: pin open drain or bidirectional output enable
      \arg         MFCOM_SHIFTER_PINCFG_BIDI: pin bidirectional output data
      \arg         MFCOM_SHIFTER_PINCFG_OUTPUT: pin output
    \param[out] none
    \retval     none
*/
void mfcom_shifter_pin_config(mfcom_shifter_enum shifter, uint32_t mode)
{
    uint32_t temp;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MFCOM_SHIFTER_PINCFG(mode)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x000A), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = MFCOM_SCTL((uint32_t)shifter);

        /* clear shifter pin configuration bits */
        temp &= ~MFCOM_SCTL_SPCFG;

        /* set shifter pin outputmode */
        temp |= mode;
        MFCOM_SCTL((uint32_t)shifter) = temp;
    }
}

/*!
    \brief      enable MFCOM timer in specific mode, API ID: 0x000B
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[in]  timermode:
      \arg         MFCOM_TIMER_DISABLE: timer disabled
      \arg         MFCOM_TIMER_BAUDMODE: dual 8-bit counters baud/bit mode
      \arg         MFCOM_TIMER_PWMMODE: dual 8-bit counters PWM mode
      \arg         MFCOM_TIMER_16BITCOUNTER: single 16-bit counter mode
    \param[out] none
    \retval     none
*/
void mfcom_timer_enable(mfcom_timer_enum timer, uint32_t timermode)
{
    uint32_t temp;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MFCOM_TIMER_MODE(timermode)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x000B), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = MFCOM_TMCTL((uint32_t)timer);

        /* clear timer mode bits */
        temp &= ~MFCOM_TMCTL_TMMOD;

        /* set timer mode */
        temp |= timermode;
        MFCOM_TMCTL((uint32_t)timer) = temp;
    }
}

/*!
    \brief      enable MFCOM shifter in specific mode, API ID: 0x000C
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  shiftermode:
      \arg         MFCOM_SHIFTER_DISABLE: shifter is disabled
      \arg         MFCOM_SHIFTER_RECEIVE: receive mode
      \arg         MFCOM_SHIFTER_TRANSMIT: transmit mode
    \param[out] none
    \retval     none
*/
void mfcom_shifter_enable(mfcom_shifter_enum shifter, uint32_t shiftermode)
{
    uint32_t temp;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MFCOM_SHIFTER_MODE(shiftermode)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x000C), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = MFCOM_SCTL((uint32_t)shifter);

        /* clear shifter mode bits */
        temp &= ~MFCOM_SCTL_SMOD;

        /* set shifter mode */
        temp |= shiftermode;
        MFCOM_SCTL((uint32_t)shifter) = temp;
    }
}

/*!
    \brief      disable MFCOM timer, API ID: 0x000D
    \param[in]  timer:  MFCOM timer number
      \arg        MFCOM_TIMER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_timer_disable(mfcom_timer_enum timer)
{
    MFCOM_TMCTL((uint32_t)timer) &= ~MFCOM_TMCTL_TMMOD;
}

/*!
    \brief      disable MFCOM shifter, API ID: 0x000E
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_disable(mfcom_shifter_enum shifter)
{
    MFCOM_SCTL((uint32_t)shifter) &= ~MFCOM_SCTL_SMOD;
}

/*!
    \brief      set MFCOM timer compare value, API ID: 0x000F
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[in]  compare: timer compare value
    \param[out] none
    \retval     none
*/
void mfcom_timer_cmpvalue_set(mfcom_timer_enum timer, uint32_t compare)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(compare > 0xFFFFU) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x000F), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        MFCOM_TMCMP((uint32_t)timer) = compare;
    }
}

/*!
    \brief      get MFCOM timer compare value, API ID: 0x0010
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[out] timer compare value
    \retval     compare value
*/
uint32_t mfcom_timer_cmpvalue_get(mfcom_timer_enum timer)
{
    return MFCOM_TMCMP((uint32_t)timer);
}

/*!
    \brief      set MFCOM timer disable mode, API ID: 0x0011
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[in]  dismode: configure conditions that can disable timers and stop decrement.
      \arg         MFCOM_TIMER_DISMODE_NEVER:            timer never disabled
      \arg         MFCOM_TIMER_DISMODE_PRE_TIMDIS:       timer disabled on timer x-1 disable
      \arg         MFCOM_TIMER_DISMODE_COMPARE:          timer disabled on timer compare
      \arg         MFCOM_TIMER_DISMODE_COMPARE_TRIGLOW:  timer disabled on timer compare and trigger Low
      \arg         MFCOM_TIMER_DISMODE_PINBOTH:          timer disabled on pin rising or falling edge
      \arg         MFCOM_TIMER_DISMODE_PINBOTH_TRIGHIGH: timer disabled on pin rising or falling edge provided trigger is high
      \arg         MFCOM_TIMER_DISMODE_TRIGFALLING:      timer disabled on trigger falling edge
    \param[out] none
    \retval     none
*/
void mfcom_timer_dismode_set(mfcom_timer_enum timer, uint32_t dismode)
{
    uint32_t temp;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MFCOM_TIMER_DISMODE(dismode)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x0011), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = MFCOM_TMCFG((uint32_t)timer);

        /* clear timer disable bits */
        temp &= ~MFCOM_TMCFG_TMDIS;

        /* set timer disable mode */
        temp |= dismode;
        MFCOM_TMCFG((uint32_t)timer) = temp;
    }
}

/*!
    \brief      set MFCOM shifter stopbit, API ID: 0x0012
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  stopbit: shifter stop bit
      \arg         MFCOM_SHIFTER_STOPBIT_DISABLE: disable shifter stop bit
      \arg         MFCOM_SHIFTER_STOPBIT_LOW: set shifter stop bit to logic low level
      \arg         MFCOM_SHIFTER_STOPBIT_HIGH: set shifter stop bit to logic high level
    \param[out] none
    \retval     none
*/
void mfcom_shifter_stopbit_set(mfcom_shifter_enum shifter, uint32_t stopbit)
{
    uint32_t temp;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MFCOM_SHIFTER_STOPBIT(stopbit)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x0012), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = MFCOM_SCFG((uint32_t)shifter);

