sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mfcom.c
        /* clear shifter stop bit */
        temp &= ~MFCOM_SCFG_SSTOP;

        /* set shifter stop bit */
        temp |= stopbit;
        MFCOM_SCFG((uint32_t)shifter) = temp;
    }
}

/*!
    \brief      write MFCOM shifter buffer, API ID: 0x0013
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  data: 32-bit data
    \param[in]  rwmode: MFCOM read write mode
      \arg         MFCOM_RWMODE_NORMAL: read and write in normal mode
      \arg         MFCOM_RWMODE_BITSWAP: read and write in bit swapped mode
      \arg         MFCOM_RWMODE_BYTESWAP: read and write in byte swapped mode
      \arg         MFCOM_RWMODE_BITBYTESWAP: read and write in bit byte swapped mode
    \param[out] none
    \retval     none
*/
void mfcom_buffer_write(mfcom_shifter_enum shifter, uint32_t data, uint32_t rwmode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MFCOM_RWMODE(rwmode)) {
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x0013), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(rwmode) {
        case MFCOM_RWMODE_NORMAL:
            /* write MFCOM shift buffer in MFCOM_RWMODE_NORMAL mode */
            MFCOM_SBUF((uint32_t)shifter) = data;
            break;
        case MFCOM_RWMODE_BITSWAP:
            /* write MFCOM shift buffer in MFCOM_RWMODE_BITSWAP mode */
            MFCOM_SBUFBIS((uint32_t)shifter) = data;
            break;
        case MFCOM_RWMODE_BYTESWAP:
            /* write MFCOM shift buffer in MFCOM_RWMODE_BYTESWAP mode */
            MFCOM_SBUFBYS((uint32_t)shifter) = data;
            break;
        case MFCOM_RWMODE_BITBYTESWAP:
            /* write MFCOM shift buffer in MFCOM_RWMODE_BITBYTESWAP mode */
            MFCOM_SBUFBBS((uint32_t)shifter) = data;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      read MFCOM shifter buffer, API ID: 0x0014
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  rwmode: MFCOM read write mode
      \arg         MFCOM_RWMODE_NORMAL: read and write in normal mode
      \arg         MFCOM_RWMODE_BITSWAP: read and write in bit swapped mode
      \arg         MFCOM_RWMODE_BYTESWAP: read and write in byte swapped mode
      \arg         MFCOM_RWMODE_BITBYTESWAP: read and write in bit byte swapped mode
    \param[out] none
    \retval     data: 32-bit data
*/
uint32_t mfcom_buffer_read(mfcom_shifter_enum shifter, uint32_t rwmode)
{
    uint32_t data = 0U;
    switch(rwmode) {
    case MFCOM_RWMODE_NORMAL:
        /* read MFCOM shift buffer in MFCOM_RWMODE_NORMAL mode */
        data = MFCOM_SBUF((uint32_t)shifter & 0x3U);
        break;
    case MFCOM_RWMODE_BITSWAP:
        /* read MFCOM shift buffer in MFCOM_RWMODE_BITSWAP mode */
        data = MFCOM_SBUFBIS((uint32_t)shifter & 0x3U);
        break;
    case MFCOM_RWMODE_BYTESWAP:
        /* read MFCOM shift buffer in MFCOM_RWMODE_BYTESWAP mode */
        data = MFCOM_SBUFBYS((uint32_t)shifter & 0x3U);
        break;
    case MFCOM_RWMODE_BITBYTESWAP:
        /* read MFCOM shift buffer in MFCOM_RWMODE_BITBYTESWAP mode */
        data = MFCOM_SBUFBBS((uint32_t)shifter & 0x3U);
        break;
    default:
#ifdef FW_DEBUG_ERR_REPORT
        fw_debug_report_err(MFCOM_MODULE_ID, API_ID(0x0014), ERR_PARAM_INVALID);
#endif /* FW_DEBUG_ERR_REPORT */
        break;
    }
    return data;
}

/*!
    \brief      get MFCOM shifter flag, API ID: 0x0015
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_shifter_flag_get(mfcom_shifter_enum shifter)
{
    FlagStatus retval = RESET;
    if(0U != (MFCOM_SSTAT & ((uint32_t)1U << shifter))) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      get MFCOM shifter error flag, API ID: 0x0016
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_shifter_error_flag_get(mfcom_shifter_enum shifter)
{
    FlagStatus retval = RESET;
    if(0U != (MFCOM_SERR & ((uint32_t)1U << shifter))) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      get MFCOM timer flag, API ID: 0x0017
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_timer_flag_get(mfcom_timer_enum timer)
{
    FlagStatus retval = RESET;
    if(0U != (MFCOM_TMSTAT & ((uint32_t)1U << timer))) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      get MFCOM shifter interrupt flag, API ID: 0x0018
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_shifter_interrupt_flag_get(mfcom_shifter_enum shifter)
{
    uint32_t interrupt_flag, interrupt_enable;
    FlagStatus retval = RESET;
    interrupt_flag = MFCOM_SSTAT & ((uint32_t)1U << shifter);
    interrupt_enable = MFCOM_SSIEN & ((uint32_t)1U << shifter);

    /* judge shifter interrupt flag state */
    if(0u != (interrupt_flag & interrupt_enable)) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      get MFCOM shifter error interrupt flag, API ID: 0x0019
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_shifter_error_interrupt_flag_get(mfcom_shifter_enum shifter)
{
    uint32_t interrupt_flag, interrupt_enable;
    FlagStatus retval = RESET;
    interrupt_flag = MFCOM_SERR & ((uint32_t)1U << shifter);
    interrupt_enable = MFCOM_SEIEN & ((uint32_t)1U << shifter);

    /* judge shifter error interrupt flag state */
    if(0u != (interrupt_flag & interrupt_enable)) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      get MFCOM timer interrupt flag, API ID: 0x001A
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_timer_interrupt_flag_get(mfcom_timer_enum timer)
{
    uint32_t interrupt_flag, interrupt_enable;
    FlagStatus retval = RESET;
    interrupt_flag = MFCOM_TMSTAT & ((uint32_t)1U << timer);
    interrupt_enable = MFCOM_TMSIEN & ((uint32_t)1U << timer);

    /* judge timer interrupt flag state */
    if(0u != (interrupt_flag & interrupt_enable)) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      clear MFCOM shifter flag, API ID: 0x001B
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_flag_clear(mfcom_shifter_enum shifter)
{
    MFCOM_SSTAT = ((uint32_t)1U << shifter);
}

/*!
    \brief    clear MFCOM shifter error flag, API ID: 0x001C
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_error_flag_clear(mfcom_shifter_enum shifter)
{
    MFCOM_SERR = ((uint32_t)1U << shifter);
}

/*!
    \brief      clear MFCOM timer flag, API ID: 0x001D
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_timer_flag_clear(mfcom_timer_enum timer)
{
    MFCOM_TMSTAT = ((uint32_t)1U << timer);
}

/*!
    \brief      enable MFCOM shifter interrupt, API ID: 0x001E
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_interrupt_enable(mfcom_shifter_enum shifter)
{
    MFCOM_SSIEN |= ((uint32_t)1U << shifter);
}

/*!
    \brief      enable MFCOM shifter error interrupt, API ID: 0x001F
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_error_interrupt_enable(mfcom_shifter_enum shifter)
{
    MFCOM_SEIEN |= ((uint32_t)1U << shifter);
}

/*!
    \brief      enable MFCOM timer interrupt, API ID: 0x0020
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_timer_interrupt_enable(mfcom_timer_enum timer)
{
    MFCOM_TMSIEN |= ((uint32_t)1U << timer);
}

/*!
    \brief      enable MFCOM shifter dma, API ID: 0x0021
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_dma_enable(mfcom_shifter_enum shifter)
{
    MFCOM_SSDMAEN |= ((uint32_t)1U << shifter);
}

/*!
    \brief      disable MFCOM shifter interrupt, API ID: 0x0022
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_interrupt_disable(mfcom_shifter_enum shifter)
{
    MFCOM_SSIEN &= ~((uint32_t)1U << shifter);
}

/*!
    \brief      disable MFCOM shifter error interrupt, API ID: 0x0023
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_error_interrupt_disable(mfcom_shifter_enum shifter)
{
    MFCOM_SEIEN &= ~((uint32_t)1U << shifter);
}

/*!
    \brief      disable MFCOM timer interrupt, API ID: 0x0024
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_timer_interrupt_disable(mfcom_timer_enum timer)
{
    MFCOM_TMSIEN &= ~((uint32_t)1U << timer);
}

/*!
    \brief      disable MFCOM shifter dma, API ID: 0x0025
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_dma_disable(mfcom_shifter_enum shifter)
{
    MFCOM_SSDMAEN &= ~((uint32_t)1U << shifter);
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
